<?php

$q = "<br>";
$w = "<hr>";
#1 - 2
echo "Лабораторна робота #1 з РНР! $q $w";
#3
echo "Додайте в код змінну з ім'ям і виведіть її значення на екран $q ";
$stud = "Ніколаєнко А.В. 122-19ск-1";
echo "$stud $q $w";
#4
echo "Виділіть імя жирним шрифтом, додавши в рядок виводу тег &ltb&gt $q";
echo " <b> $stud </b> $q $w";
#5
echo "Створіть дві змінні і запишіть в третю результат додавання цих
змінних. Виведіть на екран фразу: $q";
$a=14;
$b=122;
$c=$a+$b;
echo "Результат додавання чисел $a й $b дорівнює $c  $q $w";
#6
echo "Виділіть курсивним накресленням числa $q";
echo "Результат додавання чисел <i>$a</i> й <i>$b</i> дорівнює <i>$c</i> $q $w";
#7
echo "Використовуючи цикл for виведіть у стовпчик 100 перших чисел $q ";
/*for($i=1;$i<=100;$i++){
    echo "$i <br>";
}*/
  for($pp = 20, $i1=1 , $i2=$pp+1 , $i3=$pp*2+1, $i4=$pp*3+1,$i5=$pp*4+1 , $i=1
      ;$i<=$pp
      ;$i++,$i1++,$i2++,$i3++,$i4++,$i5++){
    echo "$i1   &nbsp; $i2  &nbsp; $i3 &nbsp; $i4 &nbsp; $i5<br> ";
}
echo "$q $w";
#8
echo "Використовуючи оператор умови визначте чи є значення змінної
суми двох чисел парним чи ні, та виведіть повідомлення: $q";


?>
