<!DOCTYPE html>
<html>

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width = device-width, initial-scale = 1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title> Лабораторна робота №10 </title>
    <link rel="stylesheet" href="style.css"> </head>

<body>
    <?php

$q = "<br>";
$w = "<hr>";
#1 - 2
echo "#1-2 Лабораторна робота #1 з РНР! $q $w";
#3
echo "#3 Додайте в код змінну з ім'ям і виведіть її значення на екран $q ";
$stud = "Ніколаєнко А.В. 122-19ск-1";
echo "$stud $q $w";
#4
echo "#4 Виділіть імя жирним шрифтом, додавши в рядок виводу тег &ltb&gt $q";
echo " <b> $stud </b> $q $w";
#5
echo "#5 Створіть дві змінні і запишіть в третю результат додавання цих
змінних. Виведіть на екран фразу: $q";
$a=14;
$b=122;
$c=$a+$b;
echo "Результат додавання чисел $a й $b дорівнює $c  $q $w";
#6
echo "#6 Виділіть курсивним накресленням числa $q";
echo "Результат додавання чисел <i>$a</i> й <i>$b</i> дорівнює <i>$c</i> $q $w";
#7
echo "#7 Використовуючи цикл for виведіть у стовпчик 100 перших чисел $q ";
/*for($i=1;$i<=100;$i++){
    echo "$i <br>";
}*/
  for($pp = 20, $i1=1 , $i2=$pp+1 , $i3=$pp*2+1, $i4=$pp*3+1,$i5=$pp*4+1 , $i=1
      ;$i<=$pp
      ;$i++,$i1++,$i2++,$i3++,$i4++,$i5++){
    echo "$i1   &nbsp; $i2  &nbsp; $i3 &nbsp; $i4 &nbsp; $i5<br> ";
}
echo "$q $w";
#8
echo "#8 Використовуючи оператор умови визначте чи є значення змінної
суми двох чисел парним чи ні, та виведіть повідомлення: $q";
$a=4;
$b=5;
$c=$a+$b;
    echo "a = $a  b = $b $q" ;
    if ( ($c % 2) == 0 ){
        echo "Сума($c) чисел($a та $b)  – парне число";
    }
    else
    {
        echo "Сума ($c) чисел($a та $b) – непарне число";
    }
 echo "$q $w";
#9
echo "#9 У циклі виведіть таблицю на 10 рядків";
?>
        <table>
            <?php
    $i = 0;
        while ($i < 10) {
            $i++;
            echo "<tr> <td> рядок № $i</td>  </tr>";
        } ?>
        </table>
        <br>
        <hr>#10 У цикл виведіть таблицю на 10 стовпців (і один рядок).
        <br>
        <table>
            <tr>
                <?php
        $i=0; while ($i < 10){
            $i++;
            echo "<td> стовпець №$i </td> ";
        }
    ?>
            </tr>
        </table>
        <br>
        <hr>
        <br> #11 Доповніть таблицю, вказавши всередині осередку номер рядка та номер стовпця у форматі
        <table>
            <tr>
                <?php
        $i=0; while ($i < 10){
            $i++;
            echo "<td> рядок №1 <br> стовпець №$i </td> ";
        }
    ?>
            </tr>
        </table>
        <br>
        <hr>
        <br> #12 Створіть функцію з параметрами, яка буде створювати таблицю при її виклику, як на прикладі. В якості параметрів необхідно використовувати кількість рядків та кількість стовбців таблиці.
        <br>
        <br>
        <?php
    function tableCreator($rows, $columns){
        echo "<table>";
        for ($r=1;$r<=$rows;$r++){
            echo "<tr> ";
                for ($c=1;$c<=$columns;$c++){
                    echo " <td> Рядок $r Стовпець $c  </td>";
                }
            echo "</tr>";
    }
         echo "</table>";
    }
    tableCreator(6,10);
    ?>
            <br>
            <hr>
            <br> #13 Виведіть таблицю для табулювання функції y=x2 в інтервалі від 1 до 20 із кроком 1 (таблиця повинна мати виділений кольором текст або фон заголовку та містити 3 стовпці: номери ітерації, значення Х, значення Y).
            <table>
                <tr>
                    <td id="td1">Номер ітерації</td>
                    <td id="td2">Значення Х</td>
                    <td id="td3">3начення У</td>
                </tr>
                <?php

        for($i=1;$i<=20;$i++){
       $y=pow($i,2);
            echo "
         <tr>
        <td id='td4'>$i</td>
        <td id='td5'>$i</td>
        <td id='td6'> $y </td>
        </tr>";
        }
    ?>
            </table>
            <br>
            <hr>
            <br> 14. Змініть початкове значення Х на "-5". Зробити так, щоб негативні числа виводились в жовтих осередках.
            <table>
                <tr>
                    <td id="td1">Номер ітерації</td>
                    <td id="td2">Значення Х</td>
                    <td id="td3">3начення У</td>
                </tr>
                <?php
        $x=-5;
        for($i=1;$i<=20;$i++){
       $y=pow($x,2);

            if($x < 0 ){
                 echo "
         <tr>
        <td id='td4'>$i</td>
        <td id='ye'>$x</td>
        <td id='td6'> $y </td>

        </tr>";
            }
            else{
            echo "
         <tr>
        <td id='td4'>$i</td>
        <td id='td5'>$x</td>
        <td id='td6'> $y </td>

        </tr>";}
            $x=$x+1;
        }
    ?>
            </table>
            <br>
            <hr>
            <br> #15. Використовуючи оператор умови визначте які значення чисел у стовпці "Значення Y" є парним, а які - ні. Зробити так, щоб парні числа виводились в зелених осередках, а непарні - в синіх.
            <table>
                <tr>
                    <td id="td1">Номер ітерації</td>
                    <td id="td2">Значення Х</td>
                    <td id="td3">3начення У</td>
                </tr>
                <?php
        $x=-5;
        for($i=1;$i<=20;$i++){
       $y=pow($x,2);

            if( ($y % 2)!=0 ){
                 echo "
         <tr>
        <td id='td4'>$i</td>
        <td id='td5'>$x</td>
        <td id='green'> $y </td>

        </tr>";
            }
            else{
            echo "
         <tr>
        <td id='td4'>$i</td>
        <td id='td5'>$x</td>
        <td id='blue'> $y </td>

        </tr>";}
            $x=$x+1;
        }
    ?>
            </table>
            <br>
            <hr>
            <br> #16. Для х, що змінюється від a до b з кроком (𝑏 − 𝑎)⁄𝑘, де 𝑘 = 10, обчислити значення функції, яка задається аналітичною формулою 𝑦 = 𝑓(𝑥) відповідно до обраного варіанту (згідно з номером у журналі). Виведіть таблицю для табулювання функції Y в інтервалі [a, b]. Таблиця повинна мати виділений кольором текст або фон заголовку та містити 3 стовпці: номери ітерації, значення Х, значення Y).
            <br>
            <table>
                <tr>
                    <td id="td1">Номер ітерації</td>
                    <td id="td2">Значення Х</td>
                    <td id="td3">3начення У</td>
                </tr>
                <?php

         $a = pi()/5;
         $b = pi();
         $k=10;
         $step = ($b-$a)/$k;
         $x=$a;



         for($i=1;$x<=$b;$i++){

             $y=1/4 * (pow ($x,2) - pow(pi(),2)/3);

             echo " <tr>
                    <td id='td4'>$i</td>
                    <td id='td5'>$x</td>
                    <td id='td6'>$y</td>
                    </tr>
             "; $x=$x+$step;
         }


         ?>
            </table>
            <br>

            <br> </body>

</html>
